#### Preppin' Data 2024 Week 01 - Prep Air's Flow Card

In [29]:
import pandas as pd

In [30]:
flow_data=pd.read_csv("PD 2024 Wk 1 Input.csv")

In [31]:
flow_data.head(5)

,Flight Details,Flow Card?,Bags Checked,Meal Type
0,2024-07-22//PA010//Tokyo-New York//Economy//2380,1,0,Egg Free
1,2024-09-28//PA008//Perth-New York//Economy//1855,0,2,Vegetarian
2,2024-04-20//PA002//New York-London//Economy//3490,1,1,Vegan
3,2024-01-23//PA010//Tokyo-New York//Premium Eco...,1,1,Vegetarian
4,2024-10-01//PA008//Perth-New York//Business Cl...,0,0,Vegetarian

In [32]:
# Finding all unique values of "Flow Card?" column.
print(flow_data["Flow Card?"].unique())

[1 0]

#### In pandas, you can split a string column into multiple columns using delimiters or regular expression patterns by the string methods str.split() and str.extract().

To get the split result as a pandas.DataFrame with multiple columns, set the expand argument to True

In [33]:
# flow_data[['Date', 'Flight Number', 'from-to', 'class', 'price']] = flow_data['Flight Details'].str.extract(r'(.*)//(.*)//(.*)-(.*)//(.*)//(.*)')

flow_data[['Date', 'Flight Number', 'from-to', 'class', 'price']] = flow_data['Flight Details'].str.split('//', expand=True)

# flow_data.head(6)

In [34]:
flow_data[['from', 'to']] = flow_data['from-to'].str.split('-', expand=True)
flow_data.head(6)

,Flight Details,Flow Card?,Bags Checked,Meal Type,Date,Flight Number,from-to,class,price,from,to
0,2024-07-22//PA010//Tokyo-New York//Economy//2380,1,0,Egg Free,2024-07-22,PA010,Tokyo-New York,Economy,2380,Tokyo,New York
1,2024-09-28//PA008//Perth-New York//Economy//1855,0,2,Vegetarian,2024-09-28,PA008,Perth-New York,Economy,1855,Perth,New York
2,2024-04-20//PA002//New York-London//Economy//3490,1,1,Vegan,2024-04-20,PA002,New York-London,Economy,3490,New York,London
3,2024-01-23//PA010//Tokyo-New York//Premium Eco...,1,1,Vegetarian,2024-01-23,PA010,Tokyo-New York,Premium Economy,825,Tokyo,New York
4,2024-10-01//PA008//Perth-New York//Business Cl...,0,0,Vegetarian,2024-10-01,PA008,Perth-New York,Business Class,634.79999999999995,Perth,New York
5,2024-03-04//PA007//New York-Perth//Business Cl...,0,3,Nut Free,2024-03-04,PA007,New York-Perth,Business Class,458.39999999999998,New York,Perth

#### To delete the column without having to reassign df you can use inplace=true, if we dont use inplace=true, changes will not be reflected without reassigning the dataframe.

In [35]:
flow_data.drop(columns='Flight Details',inplace=True)

In [36]:
flow_data['Date']=pd.to_datetime(flow_data['Date'])

In [37]:
flow_data['price']= flow_data['price'].astype(float)
flow_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3778 entries, 0 to 3777
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Flow Card?     3778 non-null   int64
 1   Bags Checked   3778 non-null   int64
 2   Meal Type      3189 non-null   object
 3   Date           3778 non-null   datetime64[ns]
 4   Flight Number  3778 non-null   object
 5   from-to        3778 non-null   object
 6   class          3778 non-null   object
 7   price          3778 non-null   float64
 8   from           3778 non-null   object
 9   to             3778 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(2), object(6)
memory usage: 295.3+ KB

In [38]:
flow_data['Flow Card?']=flow_data['Flow Card?'].map({1: 'yes', 0: 'no'})
flow_data.head()

,Flow Card?,Bags Checked,Meal Type,Date,Flight Number,from-to,class,price,from,to
0,yes,0,Egg Free,2024-07-22,PA010,Tokyo-New York,Economy,2380.0,Tokyo,New York
1,no,2,Vegetarian,2024-09-28,PA008,Perth-New York,Economy,1855.0,Perth,New York
2,yes,1,Vegan,2024-04-20,PA002,New York-London,Economy,3490.0,New York,London
3,yes,1,Vegetarian,2024-01-23,PA010,Tokyo-New York,Premium Economy,825.0,Tokyo,New York
4,no,0,Vegetarian,2024-10-01,PA008,Perth-New York,Business Class,634.8,Perth,New York

In [ ]:
flow_data = flow_data[['SKU', 'SKU', 'Title', 'Cost']]